//============================================================
// Основное задание.
// Написать программу, которая задает массив из 8 элементов и выводит их на экран.
//============================================================

Random num= new Random();
int val=num.Next(0, 10);
System.Console.WriteLine(val);


//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
// * Дополнительное задание.
// Ввести с клавиатуры длинну массива и диапазон значений
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
